// certificatesData.js

export const certificates = [
    {
        "id": "cert-1",
        "title": "ประกาศนียบัตรเข้าร่วมค่ายคณิตศาสตร์",
        "year": 2567,
        "thumbnail": "./assets/Certificate/Certificate_001.jpg",
        "src": "./assets/Certificate/Certificate_001.jpg",
        "desc": "ประกาศนียบัตรรับรองการเข้าร่วมกิจกรรม 'ค่ายคณิตศาสตร์ (NP MATH CAMP) ครั้งที่ 1' ณ โรงเรียนน้ำปลีกศึกษา อำเภอเมือง จังหวัดอำนาจเจริญ",
        "shortDesc": "ค่ายคณิตศาสตร์"
    },
    {
        "id": "cert-2",
        "title": "ประกาศนียบัตรนักเรียนจิตอาสาดีเด่น",
        "year": 2567,
        "thumbnail": "./assets/Certificate/Certificate_002.jpg",
        "src": "./assets/Certificate/Certificate_002.jpg",
        "desc": "ประกาศนียบัตรรับรองการเป็นนักเรียนจิตอาสาดีเด่น ในกิจกรรมการเดินทางไกลและอยู่ค่ายพักแรม ลูกเสือ - เนตรนารี และบำเพ็ญประโยชน์ ประจำปีการศึกษา 2567",
        "shortDesc": "นักเรียนจิตอาสา"
    },
    {
        "id": "cert-3",
        "title": "ประกาศนียบัตรรางวัลเหรียญทอง การแข่งขันหุ่นยนต์",
        "year": 2566,
        "thumbnail": "./assets/Certificate/Certificate_003.jpg",
        "src": "./assets/Certificate/Certificate_003.jpg",
        "desc": "ประกาศนียบัตรรับรางวัลเหรียญทอง กิจกรรมการแข่งขันหุ่นยนต์ระดับกลาง ระดับชั้น ม.1-ม.3 ในงานศิลปหัตถกรรมนักเรียน ระดับเขตพื้นที่การศึกษา ครั้งที่ 70 ประจำปีการศึกษา 2565",
        "shortDesc": "แข่งขันหุ่นยนต์"
    },
    {
        "id": "cert-4",
        "title": "ประกาศนียบัตรเยาวชน TO BE NUMBER ONE",
        "year": 2566,
        "thumbnail": "./assets/Certificate/Certificate_004.jpg",
        "src": "./assets/Certificate/Certificate_004.jpg",
        "desc": "ประกาศนียบัตรรับรองการเข้าร่วมพัฒนาแกนนำเยาวชน TO BE NUMBER ONE เพื่อเป็นต้นแบบการเป็นคนดี คนเก่ง และมีคุณภาพ ประจำปีงบประมาณ 2566",
        "shortDesc": "TO BE NUMBER ONE"
    },
    {
        "id": "cert-5",
        "title": "ประกาศนียบัตรผ่านการอบรมค่าย Reunion เยาวชนสร้างชาติ",
        "year": 2567,
        "thumbnail": "./assets/Certificate/Certificate_005.jpg",
        "src": "./assets/Certificate/Certificate_005.jpg",
        "desc": "ประกาศนียบัตรรับรองการผ่านการอบรมโครงการค่าย Reunion เยาวชนสร้างชาติ ดี เก่ง กล้า จังหวัดอำนาจเจริญ (ครั้งที่ 1) จัดโดย นักศึกษาหลักสูตรนักบริหารระดับสูงเพื่อการสร้างชาติ รุ่นที่ 13",
        "shortDesc": "ค่ายเยาวชนสร้างชาติ"
    },
    {
        "id": "cert-6",
        "title": "ประกาศนียบัตรฝึกอบรมพัฒนาทักษะชีวิตและทักษะอาชีพ",
        "year": 2566,
        "thumbnail": "./assets/Certificate/Certificate_006.jpg",
        "src": "./assets/Certificate/Certificate_006.jpg",
        "desc": "ประกาศนียบัตรรับรองการเข้าร่วมโครงการฝึกอบรมพัฒนาทักษะชีวิตและทักษะอาชีพ เพื่อเตรียมความพร้อมเด็กไทยสู่การเป็นผู้ประกอบการรุ่นเยาว์ รุ่นที่ ๑",
        "shortDesc": "อบรมทักษะชีวิตและอาชีพ"
    },
    {
        "id": "cert-7",
        "title": "ประกาศนียบัตรเข้าร่วมการแข่งขันปัญหาทางกฎหมาย",
        "year": 2566,
        "thumbnail": "./assets/Certificate/Certificate_007.jpg",
        "src": "./assets/Certificate/Certificate_007.jpg",
        "desc": "ประกาศนียบัตรรับรองการเข้าร่วมการคัดเลือกตัวแทนโรงเรียน เพื่อไปแข่งขันปัญหาทางกฎหมาย เนื่องในวันรพีวิชาการศึกษาพร้อมรางวัล ณ ศาลเยาวชนและครอบครัวจังหวัดอำนาจเจริญ",
        "shortDesc": "แข่งขันปัญหาทางกฎหมาย"
    },
    {
        "id": "cert-8",
        "title": "ประกาศนียบัตรคณะกรรมการสภานักเรียน",
        "year": 2566,
        "thumbnail": "./assets/Certificate/Certificate_008.jpg",
        "src": "./assets/Certificate/Certificate_008.jpg",
        "desc": "ประกาศนียบัตรรับรองการเป็นคณะกรรมการสภานักเรียน และคณะกรรมการดำเนินงาน ผู้มีความเสียสละและอุทิศเวลา และความสามารถในการร่วมวางแผนและดำเนินการตามกิจกรรม ด้วยความตั้งใจและมีความรับผิดชอบ เนื่องในพิธีไหว้ครู ประจำปีการศึกษา 2566",
        "shortDesc": "คณะกรรมการสภานักเรียน"
    },
    {
        "id": "cert-9",
        "title": "ประกาศนียบัตรนักเรียนผู้มีจิตอาสาดีเด่น",
        "year": 2567,
        "thumbnail": "./assets/Certificate/Certificate_009.jpg",
        "src": "./assets/Certificate/Certificate_009.jpg",
        "desc": "ประกาศนียบัตรรับรองการได้รับคัดเลือกให้เป็น นักเรียนผู้มีจิตอาสาดีเด่น ภาคเรียนที่ ๑ ปีการศึกษา ๒๕๖๗",
        "shortDesc": "นักเรียนจิตอาสาดีเด่น"
    },
    {
        "id": "cert-10",
        "title": "ประกาศนียบัตรอบรมเชิงปฏิบัติการห้องเรียนพิเศษวิทยาศาสตร์",
        "year": 2567,
        "thumbnail": "./assets/Certificate/Certificate_010.jpg",
        "src": "./assets/Certificate/Certificate_010.jpg",
        "desc": "ประกาศนียบัตรรับรองการเข้าร่วมโครงการอบรมเชิงปฏิบัติการห้องเรียนพิเศษวิทยาศาสตร์ ณ คณะวิทยาศาสตร์ มหาวิทยาลัยอุบลราชธานี",
        "shortDesc": "อบรมห้องเรียนวิทย์"
    },
    {
        "id": "cert-11",
        "title": "ประกาศนียบัตรผู้ปฏิบัติตนตามคุณลักษณะอันพึงประสงค์",
        "year": 2568,
        "thumbnail": "./assets/Certificate/Certificate_011.jpg",
        "src": "./assets/Certificate/Certificate_011.jpg",
        "desc": "ประกาศนียบัตรรับรองการเป็นผู้ปฏิบัติตนตามคุณลักษณะอันพึงประสงค์ ข้อที่ ๔ 'อยู่อย่างพอเพียง' ชั้นมัธยมศึกษาปีที่ ๕/๒ ประจำปีการศึกษา ๒๕๖๗",
        "shortDesc": "คุณลักษณะพอเพียง"
    }
];
