// projectsData.js

export const projects = [
    {
        "id": "project-1",
        "title": "การออกแบบแผนผังโครงสร้างเครือข่ายอินเทอร์เน็ต",
        "category": "it",
        "year": 2024,
        "type": "image",
        "thumbnail": "assets/images/1741780829154.jpg",
        "src": "assets/images/1741780829154.jpg",
        "desc": "ดำเนินการออกแบบแผนผังโครงสร้างท่อร้อยสายสัญญาณเครือข่ายอินเทอร์เน็ตภายในอาคาร จากห้องเซิร์ฟเวอร์ไปยังชั้น 3 ของอาคาร",
        "shortDesc": "ออกแบบแผนผังโครงสร้างท่อร้อยสายเครือข่าย"
    },
    {
        "id": "project-2",
        "title": "การปรับปรุงโปรแกรมคอมพิวเตอร์",
        "category": "it",
        "year": 2024,
        "type": "image",
        "thumbnail": "assets/images/1739578807758.jpg",
        "src": "assets/images/1739578807758.jpg",
        "desc": "ดำเนินการปรับปรุงโปรแกรมต่างๆ ภายในเครื่องคอมพิวเตอร์",
        "shortDesc": "ปรับปรุงโปรแกรมในคอมพิวเตอร์"
    },
    {
        "id": "project-3",
        "title": "การเข้าหัวสายแลน",
        "category": "it",
        "year": 2024,
        "type": "image",
        "thumbnail": "assets/images/IMG20250329132925.jpg",
        "src": "assets/images/IMG20250329132925.jpg",
        "desc": "ดำเนินการเข้าหัวสายแลนและจัดเก็บเข้าตู้ พร้อมเตรียมการทดสอบความเร็ว",
        "shortDesc": "เข้าหัวสายแลนและเตรียมทดสอบความเร็ว"
    },
    {
        "id": "project-4",
        "title": "การทดสอบความเร็วเครือข่ายอินเทอร์เน็ต",
        "category": "it",
        "year": 2024,
        "type": "image",
        "thumbnail": "assets/images/IMG20250506092117.jpg",
        "src": "assets/images/IMG20250506092117.jpg",
        "desc": "ดำเนินการทดสอบความเร็วเครือข่ายอินเทอร์เน็ตเพื่อให้ได้มาตรฐานที่ 900 เมกะบิตต่อวินาที",
        "shortDesc": "ทดสอบความเร็วอินเทอร์เน็ต"
    },
    {
        "id": "project-5",
        "title": "การติดตั้งสายไฟฟ้าและบล็อกไฟภายในห้องคอมพิวเตอร์",
        "category": "it",
        "year": 2024,
        "type": "image",
        "thumbnail": "assets/images/IMG20250507104510.jpg",
        "src": "assets/images/IMG20250507104510.jpg",
        "desc": "ดำเนินการตัดสายไฟฟ้าและติดตั้งเข้ากับบล็อกไฟเพื่อใช้งานภายในห้องคอมพิวเตอร์",
        "shortDesc": "ติดตั้งสายไฟฟ้าในห้องคอมพิวเตอร์"
    },
    {
        "id": "project-6",
        "title": "การจัดทำโปสเตอร์ประกาศ",
        "category": "แต่งภาพ",
        "year": 2024,
        "type": "image",
        "thumbnail": "assets/images/39a4db3b-f6e8-467f-88ce-c40193c8972aphoto.png",
        "src": "assets/images/39a4db3b-f6e8-467f-88ce-c40193c8972aphoto.png",
        "desc": "ดำเนินการจัดทำโปสเตอร์เพื่อประกาศผลการเลือกตั้งประธานนักเรียน",
        "shortDesc": "ออกแบบโปสเตอร์เลือกตั้งประธานนักเรียน"
    },
    {
        "id": "project-7",
        "title": "การปฏิบัติหน้าที่ช่างภาพในกิจกรรมต่างๆ",
        "category": "แต่งภาพ",
        "year": 2024,
        "type": "image",
        "thumbnail": "assets/images/1751162337512.jpg",
        "src": "assets/images/1751162337512.jpg",
        "desc": "ปฏิบัติหน้าที่เป็นช่างภาพในการบันทึกภาพกิจกรรมต่างๆ",
        "shortDesc": "ถ่ายภาพกิจกรรมต่างๆ"
    },
    {
        "id": "project-8",
        "title": "การซ่อมบำรุงคอมพิวเตอร์เพื่อการใช้งาน",
        "category": "it",
        "year": 2024,
        "type": "image",
        "thumbnail": "assets/images/IMG_20250313_053720.jpg",
        "src": "assets/images/IMG_20250313_053720.jpg",
        "desc": "ดำเนินการเปลี่ยนหน่วยเก็บข้อมูลแบบ Solid State Drive (SSD) และจัดระเบียบสายไฟฟ้าภายในเครื่องคอมพิวเตอร์",
        "shortDesc": "ซ่อมบำรุงคอมพิวเตอร์และจัดระเบียบสายไฟฟ้า"
    },
    {
        "id": "project-9",
        "title": "การสนับสนุนการควบคุมเสียงเพลงและการนำเสนอเกมผ่านโปรเจคเตอร์ในกิจกรรม",
        "category": "it",
        "year": 2024,
        "type": "image",
        "thumbnail": "assets/images/IMG20250529092723.jpg",
        "src": "assets/images/IMG20250529092723.jpg",
        "desc": "ให้ความช่วยเหลือในการควบคุมเสียงเพลงและนำเสนอเกมผ่านโปรเจคเตอร์ในกิจกรรม เพื่อเพิ่มความบันเทิงและสร้างความสนุกสนาน",
        "shortDesc": "ควบคุมเสียงเพลงและเกมในกิจกรรม"
    },
    {
        "id": "project-10",
        "title": "การฝึกซ้อมแข่งขันหุ่นยนต์ระดับกลาง",
        "category": "เเข่งหุ่นยนต์",
        "year": 2023,
        "type": "image",
        "thumbnail": "assets/images/093739.png",
        "src": "assets/images/093739.png",
        "desc": "เข้าร่วมการฝึกซ้อมแข่งขันหุ่นยนต์ระดับกลาง และได้รับรางวัลเหรียญทอง",
        "shortDesc": "ฝึกซ้อมแข่งขันหุ่นยนต์"
    },
    {
        "id": "project-11",
        "title": "การตัดต่ออินโทร โลโก และ VTR",
        "category": "ตัดต่อ",
        "year": 2024,
        "type": "image",
        "thumbnail": "assets/images/094024.png",
        "src": "assets/images/094024.png",
        "desc": "ดำเนินการตัดต่ออินโทร โลโก และวิดีทัศน์ (VTR) สำหรับโรงเรียน",
        "shortDesc": "ตัดต่อ Intro และ VTR"
    },
    {
        "id": "project-12",
        "title": "การทดลองใช้งาน ESP32",
        "category": "it",
        "year": 2024,
        "type": "image",
        "thumbnail": "assets/images/095615.png",
        "src": "assets/images/095615.png",
        "desc": "ดำเนินการทดลองใช้งาน ESP32 โดยแสดงผลแอนิเมชันอย่างง่าย",
        "shortDesc": "ทดลองใช้งาน ESP32"
    },
    {
        "id": "project-13",
        "title": "การพัฒนาบอทเกมบน Discord",
        "category": "code",
        "year": 2024,
        "type": "image",
        "thumbnail": "assets/images/IMG_20241212_215204.jpg",
        "src": "assets/images/IMG_20241212_215204.jpg",
        "desc": "ดำเนินการสร้างเกมอย่างง่ายบนแพลตฟอร์ม Discord เพื่อวัตถุประสงค์ทางการศึกษา",
        "shortDesc": "พัฒนา Discord Bot Game"
    },
    {
        "id": "project-14",
        "title": "การสร้างโค้ด Python ด้วยปัญญาประดิษฐ์",
        "category": "code",
        "year": 2025,
        "type": "image",
        "thumbnail": "assets/images/113700.png",
        "src": "assets/images/113700.png",
        "desc": "ในช่วงเวลาดังกล่าว ผมได้ทำการดึงไฟล์จากกล้องถ่ายภาพ และเนื่องจากไม่ได้ติดตั้งแอปพลิเคชันแปลงไฟล์ จึงได้พัฒนาโค้ดนี้ขึ้นมา ซึ่งโค้ดดังกล่าวสามารถดูได้ที่ GitHub",
        "shortDesc": "สร้างโค้ด Python ด้วย AI"
    },
    {
        "id": "project-15",
        "title": "การปฏิบัติหน้าที่ผู้ช่วยตัดต่อและกำกับภาพยนตร์สั้น",
        "category": "ตัดต่อ",
        "year": 2025,
        "type": "image",
        "thumbnail": "assets/images/204654.png",
        "src": "assets/images/204654.png",
        "desc": "ท่านสามารถรับชมคลิปวิดีโอได้ทันที",
        "shortDesc": "ผู้ช่วยตัดต่อและกำกับภาพยนตร์สั้น"
    },
    {
        "id": "project-16",
        "title": "การดำรงตำแหน่งสมาชิกสภานักเรียน",
        "category": "สภานักเรียน",
        "year": 2024,
        "type": "image",
        "thumbnail": "assets/images/IMG_20250223_115236.jpg",
        "src": "assets/images/IMG_20250223_115236.jpg",
        "desc": "ผมได้รับมอบหมายให้ดำรงตำแหน่งหัวหน้าฝ่ายโสตทัศนูปกรณ์",
        "shortDesc": "สมาชิกสภานักเรียนฝ่ายโสตทัศนูปกรณ์"
    },
];

export const certificates = [
    {
        id: 'cert-001',
        src: './assets/Certificate/Certificate_001.jpg',
        title: 'เกียรติบัตรเข้าร่วมค่ายคณิตศาสตร์',
        desc: 'ได้รับเกียรติบัตรจากการเข้าร่วมกิจกรรม "ค่ายคณิตศาสตร์ (NP MATH CAMP) ครั้งที่ 1" ที่โรงเรียนน้ำปลีกศึกษา'
    },
    {
        id: 'cert-002',
        src: './assets/Certificate/Certificate_002.jpg',
        title: 'เกียรติบัตรนักเรียนจิตอาสา',
        desc: 'ได้รับเกียรติบัตรในฐานะนักเรียนจิตอาสาที่มีส่วนร่วมในกิจกรรมลูกเสือและกิจกรรมเพื่อสังคมประจำปีการศึกษา 2567'
    },
    {
        id: 'cert-003',
        src: './assets/Certificate/Certificate_003.jpg',
        title: 'เกียรติบัตรรางวัลเหรียญทองการแข่งขันหุ่นยนต์',
        desc: 'ได้รับรางวัลเหรียญทองจากการแข่งขันหุ่นยนต์ระดับกลาง ระดับชั้น ม.4 - ม.6 ในงานมหกรรมวิชาการระดับชาติ'
    },
    {
        id: 'cert-004',
        src: './assets/Certificate/Certificate_004.jpg',
        title: 'ประกาศนียบัตรแกนนำเยาวชน TO BE NUMBER ONE',
        desc: 'ได้รับประกาศนียบัตรจากการเป็นแกนนำเยาวชนในโครงการ TO BE NUMBER ONE เพื่อเป็นต้นแบบการเป็นคนดีและคนเก่ง'
    },
    {
        id: 'cert-005',
        src: './assets/Certificate/Certificate_005.jpg',
        title: 'ประกาศนียบัตรอบรมเยาวชนสร้างชาติ',
        desc: 'ผ่านการอบรมโครงการค่าย Reunion เยาวชนสร้างชาติ ดี เก่ง กล้า จัดโดยนักบริหารระดับสูงเพื่อการสร้างชาติ'
    },
    {
        id: 'cert-006',
        src: './assets/Certificate/Certificate_006.jpg',
        title: 'เกียรติบัตรพัฒนาทักษะชีวิตและทักษะอาชีพ',
        desc: 'ได้รับเกียรติบัตรจากการเข้าร่วมโครงการฝึกอบรมพัฒนาทักษะชีวิตและทักษะอาชีพเพื่อเตรียมความพร้อมสู่การเป็นผู้ประกอบการรุ่นเยาว์'
    },
    {
        id: 'cert-007',
        src: './assets/Certificate/Certificate_007.jpg',
        title: 'เกียรติบัตรตัวแทนแข่งขันตอบปัญหากฎหมาย',
        desc: 'ได้รับเกียรติบัตรจากการคัดเลือกเป็นตัวแทนโรงเรียนเพื่อแข่งขันตอบปัญหากฎหมาย'
    },
    {
        id: 'cert-008',
        src: './assets/Certificate/Certificate_008.jpg',
        title: 'เกียรติบัตรคณะกรรมการสภานักเรียน',
        desc: 'ได้รับเกียรติบัตรในฐานะคณะกรรมการสภานักเรียน ผู้มีความเสียสละและอุทิศเวลา และความสามารถในการร่วมวางแผนและดำเนินการตามกิจกรรมด้วยความตั้งใจและความรับผิดชอบ เนื่องในพิธีไหว้ครู ประจำปีการศึกษา 2568'
    },
    {
        id: 'cert-009',
        src: './assets/Certificate/Certificate_009.jpg',
        title: 'เกียรติบัตรนักเรียนจิตอาสาดีเด่น',
        desc: 'ได้รับเกียรติบัตรในฐานะนักเรียนผู้มีจิตอาสาดีเด่น ภาคเรียนที่ 1 ปีการศึกษา 2567'
    },
    {
        id: 'cert-010',
        src: './assets/Certificate/Certificate_010.jpg',
        title: 'เกียรติบัตรอบรมเชิงปฏิบัติการวิทยาศาสตร์',
        desc: 'ได้รับเกียรติบัตรจากการเข้าร่วมโครงการอบรมเชิงปฏิบัติการวิทยาศาสตร์ที่คณะวิทยาศาสตร์ มหาวิทยาลัยอุบลราชธานี'
    },
    {
        id: 'cert-011',
        src: './assets/Certificate/Certificate_011.jpg',
        title: 'เกียรติบัตรคุณลักษณะอันพึงประสงค์',
        desc: 'ได้รับเกียรติบัตรในฐานะผู้ปฏิบัติตนตรงตามคุณลักษณะอันพึงประสงค์ข้อที่ 5 "อยู่อย่างพอเพียง"'
    }
];
